package tools

import (
	"math/rand"
	"time"
)

var faces = []string{
	"(ง ˙o˙)ว",
	"( ⁼̴̀ .̫ ⁼̴ )✧",
	"(⁎⁍̴̛ᴗ⁍̴̛⁎)",
	"(◍•ᴗ•◍)",
	"⁽(◍˃̵͈̑ᴗ˂̵͈̑)⁽",
	"(৹ᵒ̴̶̷᷄́ฅᵒ̴̶̷᷅৹)",
	"~(˶‾᷄ꈊ‾᷅˵)~",
	"̋(๑˃́ꇴ˂̀๑)",
	"( ᵒ̴̶̷̤ꈊ˂̶̤̀ )✧",
	",,Ծ‸Ծ,,",
	"(๑ᵒ̴̶̷͈᷄ᗨᵒ̴̶̷͈᷅)",
	"◔.̮◔✧",
	"(ᕑᗢᓫ∗)˒",
	"(*ꈍ꒙ꈍ*)",
	"(๑´0`๑)",
	"(ˊo̴̶̷̤ ̫ o̴̶̷̤ˋ)",
	"*⸜( •ᴗ• )⸝*",
	"( ૢ⁼̴̤̆ ꇴ ⁼̴̤̆ ૢ)~ෆ",
	"(˶˚ ᗨ ˚˶)",
	"(ˊᵒ̴̶̷̤ꇴᵒ̴̶̷̤ˋ)",
	"(⁎⁍̴̛ᴗ⁍̴̛⁎)",
	"(〃'▽'〃)",
	"(๑ ꒪ꌂ꒪๑)",
	"- ̗̀(ᵔ⌔ᵔ)",
	"ᖘ ❛‿˂̵✧",
}

func RandomFace() string {
	r := rand.New(rand.NewSource(time.Now().UnixNano()))
	return faces[r.Intn(len(faces))]
}
